// pages/encyclopedia/encyclopedia.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    list: [
      {
        id: '23sdfsd',
        title: '吉娃娃的价格，吉娃娃多少钱吉娃娃的价格，吉娃娃多少钱吉娃娃的价格，吉娃娃多少钱',
        image: 'https://ss0.bdstatic.com/70cFvHSh_Q1YnxGkpoWK1HF6hhy/it/u=3130831242,3543851410&fm=26&gp=0.jpg',
        info: '中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。',
        content: '中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。',
        date: '21-09-08 12:09:00',
        hits: 3234
      },
      {
        id: '23s3dfsd',
        title: '吉娃娃的价格，吉娃娃多少钱吉娃娃的价格，吉娃娃多少钱吉娃娃的价格，吉娃娃多少钱',
        image: 'https://ss0.bdstatic.com/70cFvHSh_Q1YnxGkpoWK1HF6hhy/it/u=1673234836,1998903344&fm=26&gp=0.jpg',
        info: '中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。',
        content: '中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。',
        date: '21-09-08 12:09:00',
        hits: 3234
      },
      {
        id: '23s356dfsd',
        title: '吉娃娃的价格，吉娃娃多少钱吉娃娃的价格，吉娃娃多少钱吉娃娃的价格，吉娃娃多少钱',
        image: 'https://ss0.bdstatic.com/70cFvHSh_Q1YnxGkpoWK1HF6hhy/it/u=1673234836,1998903344&fm=26&gp=0.jpg',
        info: '中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。',
        content: '中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。',
        date: '21-09-08 12:09:00',
        hits: 3234
      },
      {
        id: '23s3dfs78978d',
        title: '吉娃娃的价格，吉娃娃多少钱吉娃娃的价格，吉娃娃多少钱吉娃娃的价格，吉娃娃多少钱',
        image: 'https://ss0.bdstatic.com/70cFvHSh_Q1YnxGkpoWK1HF6hhy/it/u=1673234836,1998903344&fm=26&gp=0.jpg',
        info: '中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。',
        content: '中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。中国目前最贵的是中国牧业协会的分会长，中国藏獒俱乐部曾经是我国，起源于西藏的一种动物。',
        date: '21-09-08 12:09:00',
        hits: 3234
      },
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})